mytries/list/app/controllers/steps_controller.rb

  def index
    @steps = Step.all
---
SELECT "steps".* FROM "steps"