try2.0/wiki/app/controllers/wiki_posts_controller.rb

SELECT "wiki_posts".* FROM "wiki_posts"
---
  def index
    @wiki_posts = WikiPost.all

SELECT "wiki_posts".* FROM "wiki_posts" WHERE "wiki_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_wiki_post
      @wiki_post = WikiPost.find(params[:id])